#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьЗначениеСвойства_Важность_Обычная() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("075e5b68-982f-11e9-81ab-00155d00f645");
	ЗначениеСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ЗначениеСсылка) Тогда 
		
		СвойствоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиСоздатьСвойство_Важность();
		ЗначениеОбъект = СоздатьЭлемент();
		ЗначениеОбъект.УстановитьСсылкуНового(ЗначениеСсылка);
		
		ЗначениеОбъект.Владелец = СвойствоСсылка;
		ЗначениеОбъект.ПолноеНаименование = НСтр("ru = 'Обычная'");
		ЗначениеОбъект.Вес = 5;
	
		ЗначениеОбъект.УстановитьНовыйКод();
		
		ЗначениеОбъект.Записать();
		
	КонецЕсли;
	
	Возврат ЗначениеСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
