#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьРоль_ДелопроизводительПодразделения() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("f5128f09-9ef6-11e9-81ab-00155d00f645");
	РольСсылка = Справочники.РолиИсполнителей.ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(РольСсылка) Тогда 
		
		РольОбъект = Справочники.РолиИсполнителей.СоздатьЭлемент();
		РольОбъект.УстановитьСсылкуНового(РольСсылка);
		
		РольОбъект.Наименование = НСтр("ru = 'Делопроизводитель'");
		РольОбъект.КраткоеПредставление = НСтр("ru = 'Делопроизводитель'");
		РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
		РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
		
		//ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
		//Если ИспользоватьУчетПоОрганизациям Тогда
		//	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация;
		//	РольОбъект.ТипыДополнительногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//Иначе 
			РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//КонецЕсли;
		
		РольОбъект.УстановитьНовыйКод();
		РольОбъект.Записать();
		
	КонецЕсли;
	
	Возврат РольСсылка;
	
КонецФункции

Функция НайтиСоздатьРоль_РегистраторПерепискиПодразделения() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("42a0ed5f-a2f1-11e9-81ab-00155d00f645");
	РольСсылка = Справочники.РолиИсполнителей.ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(РольСсылка) Тогда
		
		РольОбъект = Справочники.РолиИсполнителей.СоздатьЭлемент();
		РольОбъект.УстановитьСсылкуНового(РольСсылка);
		
		РольОбъект.Наименование = НСтр("ru = 'Регистратор переписки'");
		РольОбъект.КраткоеПредставление = НСтр("ru = 'Регистратор переписки'");
		РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
		РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
		
		//ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
		//Если ИспользоватьУчетПоОрганизациям Тогда
		//	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация;
		//	РольОбъект.ТипыДополнительногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//Иначе 
			РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//КонецЕсли;
		
		РольОбъект.УстановитьНовыйКод();
		РольОбъект.Записать();
		
	КонецЕсли;
	
	Возврат РольСсылка;
	
КонецФункции

Функция НайтиСоздатьРоль_РуководительПодразделения() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("cd73c395-bb90-11e6-815b-00155d00f645");
	РольСсылка = Справочники.РолиИсполнителей.ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(РольСсылка) Тогда 
		
		РольОбъект = Справочники.РолиИсполнителей.СоздатьЭлемент();
		РольОбъект.УстановитьСсылкуНового(РольСсылка);
		
		РольОбъект.Наименование = НСтр("ru = 'Руководитель подразделения'");
		РольОбъект.КраткоеПредставление = НСтр("ru = 'Рук. подр.'");
		РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
		РольОбъект.ИспользуетсяБезОбъектовАдресации = Ложь;
		
		//ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
		//Если ИспользоватьУчетПоОрганизациям Тогда
		//	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация;
		//	РольОбъект.ТипыДополнительногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//Иначе 
			РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение;
		//КонецЕсли;
		
		РольОбъект.УстановитьНовыйКод();
		
		РольОбъект.Записать();
		
	КонецЕсли;
	
	Возврат РольСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
