////////////////////////////////////////////////////////////////////////////////
// Подсистема "Мультипредметность"
// Модуль Мультипредметность: сервер, внешнее соединение
//
// Содержит процедуры и функции обработки объектов и механизмов, 
// поддерживающих мультипредметность.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Помечает основной предмет процесса на удаление
//
// Параметры:
//  ПроцессСсылка	 - БизнесПроцессСсылка	 - ссылка на процесс, предмет которого следует пометить на удаление.
//  Основные		 - Булево	 - пометить только основные предметы процесса.
//
Процедура УстановитьПометкуУдаленияДляПредметовПроцесса(Знач ПроцессСсылка, Основные = Неопределено) Экспорт
	
	ПредметыПроцесса = Мультипредметность.ПолучитьПредметыПроцесса(ПроцессСсылка, Основные);
	
	Для Каждого СтрПредмет Из ПредметыПроцесса Цикл
		Делопроизводство.УстановитьПометкуУдаления(СтрПредмет.Предмет, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
