
#Область СлужебныеПроцедурыИФункции

&Вместо("ПолучитьСтруктуруПараметровОтправкиПисьма")
Функция ИТГ_ПолучитьСтруктуруПараметровОтправкиПисьма(ПисьмоОбъект, ТолькоАдресаЭлектроннойПочты, ЭтоВложенноеПисьмо)
	
	ПараметрыОтправки = ПродолжитьВызов(ПисьмоОбъект, ТолькоАдресаЭлектроннойПочты, ЭтоВложенноеПисьмо);
	
	ЗначениеЗаголовкаAutoReply = ИТГ_ВстроеннаяПочтаСервер.ПолучитьПолеЗаголовкаИзПараметровОтправкиПисьма(ПараметрыОтправки, "X-1C-AutoReply");
	Если ЗначениеЗаголовкаAutoReply = "true" Тогда 
		
		// https://docs.microsoft.com/en-us/openspecs/exchange_server_protocols/ms-oxcmail/ced68690-498a-4567-9d14-5c01f974d8b1?redirectedfrom=MSDN
		ПараметрыОтправки.ПоляЗаголовка.Добавить(
			Почта.СформироватьСтруктуруПоляЗаголовка(
				"X-Auto-Response-Suppress",
				"DR, NDR, RN, NRN, OOF",
				СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения.БезКодирования));
				
		ВходящееПисьмо = СвязиДокументов.ПолучитьСвязанныйДокумент(ПисьмоОбъект.Ссылка, Справочники.ТипыСвязей.ПисьмоОтправленоВОтветНа);
		
		Если ВходящееПисьмо = Неопределено Тогда
			ЗначениеЗаголовкаAutoSubmitted = "auto-generated";
		Иначе 
			ЗначениеЗаголовкаAutoSubmitted = "auto-replied";
		КонецЕсли;
			
		// https://www.iana.org/assignments/auto-submitted-keywords/auto-submitted-keywords.xhtml
		// https://tools.ietf.org/html/rfc3834#section-5
		ПараметрыОтправки.ПоляЗаголовка.Добавить(
			Почта.СформироватьСтруктуруПоляЗаголовка(
				"Auto-Submitted",
				ЗначениеЗаголовкаAutoSubmitted,
				СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения.БезКодирования));
				
	КонецЕсли;		
	
	Возврат ПараметрыОтправки;
	
КонецФункции

#КонецОбласти
