#Область ПрограммныйИнтерфейс

// Проверяет, находится ли руководитель подразделения, указанного в документе,
//  в числе исполнителей задач по документу, как по основному предмету
//  (только по процессам исполнения, рассмотрения, ознакомления).
//  Применяется в условиях маршрутизации процессов.
//
// Параметры:
//  Документ - СправочникСсылка	 - ссылка на внутренний либо входящий документ
// 
// Возвращаемое значение:
//  Булево - Истина, если документ на исполнении, Ложь - если нет
//
Функция ПроверитьРуководительПодразделенияВЧислеИсполнителей(Знач Документ) Экспорт
		
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РуководительПодразделения = ИТГ_ШаблоныБизнесПроцессов.ПолучитьРуководителяПодразделенияДокумента(Документ);
	
	Если Не ЗначениеЗаполнено(РуководительПодразделения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РуководительНайденВЧислеИсполнителей = Ложь;
	
	Если ТипЗнч(РуководительПодразделения) = Тип("СправочникСсылка.ПолныеРоли") Тогда
		РуководителиПодразделения = РегистрыСведений.ИсполнителиЗадач.ИсполнителиРоли(РуководительПодразделения);
	Иначе
		РуководителиПодразделения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РуководительПодразделения);
	КонецЕсли;
	
	АктивныеИсполнители = ИТГ_ШаблоныБизнесПроцессов.ПолучитьИсполнителейДокументаАктивных(Документ);
	Для Каждого Руководитель Из РуководителиПодразделения Цикл
		Для Каждого Исполнитель Из АктивныеИсполнители Цикл
			Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли") Тогда
				РуководительНайденВЧислеИсполнителей = РегистрыСведений.ИсполнителиЗадач.ИсполнителиРоли(Исполнитель).Найти(Руководитель) <> Неопределено;
			Иначе
				РуководительНайденВЧислеИсполнителей = (Руководитель = Исполнитель);
			КонецЕсли;
			Если РуководительНайденВЧислеИсполнителей Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат РуководительНайденВЧислеИсполнителей;
	
КонецФункции

#КонецОбласти
