////////////////////////////////////////////////////////////////////////////////
// Подсистема "Мультипредметность"
// Модуль Мультипредметность: сервер, внешнее соединение
//
// Содержит процедуры и функции обработки объектов и механизмов, 
// поддерживающих мультипредметность.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Помечает основной предмет процесса на удаление
//
Процедура УстановитьПометкуУдаленияДляПредметовПроцесса(ПроцессСсылка, Основные = Неопределено) Экспорт
	
	ПредметыПроцесса = ПолучитьПредметыПроцесса(ПроцессСсылка, Основные);
	
	Для Каждого СтрПредмет Из ПредметыПроцесса Цикл
		Делопроизводство.УстановитьПометкуУдаления(СтрПредмет.Предмет, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
