////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс бизнес-событий

#Область СлужебныеПроцедурыИФункции

// Определяет, является ли ВходящееПисьмо входящим письмом от сканера
//
// Параметры:
//  ВходящееПисьмо	 - ДокументСсылка.ВходящееПисьмо	 - письмо, которое необходимо проверить
// 
// Возвращаемое значение:
//  Булево - 
//
Функция ЭтоВходящееПисьмоОтСканера(Знач ВходящееПисьмо) Экспорт
	
	Контекст = "ИТГ_БизнесСобытияПереопределяемый.ЭтоВходящееПисьмоОтСканера";
	
	Если Не ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(ВходящееПисьмо) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	АдресАдресанта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВходящееПисьмо, "ОтправительАдресат.Адрес");
	
	// TODO: В следующих версиях рассмотреть возможность добавление реквизита в справочник
	// АдресатыПочтовыхСообщений, и по этому реквизиту и определять, является ли
	// адресант сканером
	
	Возврат ИТГ_СтроковыеФункцииКлиентСервер.ПроверитьСтроку(АдресАдресанта, "[pP]\d{5}@csm\.nov\.ru");
	
КонецФункции

// Определяет, является ли ВходящееПисьмо входящим письмом от корреспондента
//
// Параметры:
//  ВходящееПисьмо	 - ДокументСсылка.ВходящееПисьмо	 - письмо, которое необходимо проверить
// 
// Возвращаемое значение:
//  Булево - 
//
Функция ЭтоВходящееПисьмоОтКорреспондента(Знач ВходящееПисьмо) Экспорт
	
	Контекст = "ИТГ_БизнесСобытияПереопределяемый.ЭтоВходящееПисьмоОтКорреспондента";
	
	Если Не ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(ВходящееПисьмо) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоВходящееПисьмоОтСканера(ВходящееПисьмо) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
