#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьСвойство_Важность() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("e9020a8b-982e-11e9-81ab-00155d00f645");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр("ru = 'Важность'");
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		СвойствоОбъект.ЭтоДополнительноеСведение = Ложь;
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция НайтиСоздатьСвойство_НаправлениеДеятельности() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("7edfb245-721b-47e6-b206-da3e55b9231c");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр("ru = 'Направление деятельности'");
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		СвойствоОбъект.ЭтоДополнительноеСведение = Ложь;
		СвойствоОбъект.ЗаполнятьОбязательно = Ложь;
		СвойствоОбъект.ТипЗначения = Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия");
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
		// И добавим его сразу в набор свойств подразделений
		НаборРеквизитовПодразделений = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктураПредприятия;
		НаборРеквизитовПодразделенийОбъект = НаборРеквизитовПодразделений.ПолучитьОбъект();
		НаборРеквизитовПодразделенийОбъект.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		НаборРеквизитовПодразделенийОбъект.Записать();
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
