#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьСвойство_Важность() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("e9020a8b-982e-11e9-81ab-00155d00f645");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр("ru = 'Важность'");
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
